Repository: crystal-jp/ja.crystal-lang.org-omegat
Catalog: crystal-jp-gh-pages-level2.tmx
Source language: en_us
Languages: ja

source: Once you install the compiler using one of the following methods, make sure to read [Using the compiler](../using_the_compiler/README.md) to learn how to efficiently use it.
ja: Crystal のコンパイラは以下のいずれかの方法でインストールすることができます。インストール後は、[「コンパイラを使用する」](../using_the_compiler/README.md)を読んで、コンパイラの活用方法について知りましょう。

source: Only one-line comments are supported for now.
ja: 現在のところ、1行 (one-line) のコメントのみがサポートされています。

source: Or you can use curly braces and specify up to six hexadecimal numbers (0 to 10FFFF):
ja: 波カッコ (ブレース) を使うと、(0 から 10FFFF までの) 16進数を指定することも可能です。

source: Regular expressions are represented by the [Regex](http://crystal-lang.org/api/Regex.html) class, which is usually created with a literal:
ja: 正規表現 (Regular Expression) を表すのは [Regex](http://crystal-lang.org/api/Regex.html) クラスです。そして、通常それは以下の正規表現リテラルによって作られます。

source: Several literals are available for creating many basic types in the language.
ja: Crystal には、数多くの基本的な型に対応したリテラルが用意されています。

source: Slashes must be escaped:
ja: スラッシュはエスケープする必要があります。

source: So replace the last line with:
ja: その場合、最後の行を以下の通りに変更してください。

source: Some syntax sugar that contains the `=` character is available:
ja: `=` を使った代入のためのシンタックスシュガーがいくつか用意されています。

source: That will add the signing key and the repository configuration.
ja: これで、署名用のキーとリポジトリの設定が追加されます。

source: The [Nil](http://crystal-lang.org/api/Nil.html) type has only one possible value:
ja: [Nil](http://crystal-lang.org/api/Nil.html) 型にはたった1つの値しか存在しません。

source: The `=` operator syntax sugar is also available to setters and indexers.
ja: セッターやインデックス指定代入の場合にも、`=` 演算子のシンタックスシュガーを利用できます。

source: The above code will make sense once you read the whole documentation, but we can already learn some things.
ja: 上記のコードをすべて理解するためにはこのドキュメント全体を読む必要がありますが、ここでいくつかの点について説明しておきます。

source: The classic "hello world" program looks like this in Crystal:
ja: 伝統的な「hello world」プログラムを Crystal で書くと次のようになります。

source: The language comes with other [syntax](../syntax_and_semantics/literals.html) as well to create arrays, hashes, ranges, tuples and more:
ja: Crystal にはその他にも多くの[シンタックス](../syntax_and_semantics/literals.html)があります。例えば、array や hash、そして range や tuple などです

source: The latest files can be found on the Releases page at GitHub: https://github.com/manastech/crystal/releases
ja: 最新のファイルは [GitHub のリリースページ](https://github.com/manastech/crystal/releases)から入手することが可能です。

source: The new compiler will be placed at `.build/crystal`.
ja: ビルドされたコンパイラは `.build/crystal` に格納されます。

source: The number of arguments must match the proc's type:
ja: そのとき、引数の数は Proc の型と一致している必要があります。

source: The program’s source code must be encoded in UTF-8.
ja: プログラムのソースコードは UTF-8 でエンコードされている必要があります。

source: The reason for this is that performance without full optimizations is still pretty good and provides fast compile times, so you can use the `crystal` command almost as if it were an interpreter.
ja: このような動作となっている理由は、完全最適化をしない場合にも、ある程度十分なパフォーマンスを維持したままで高速なコンパイルが可能であるため、まるでインタープリタのように `crystal` コマンドを使用することができるからです。

source: The return type is inferred from the proc's body.
ja: 戻り値の型は Proc の内容から推論されます。

source: The types of the arguments are mandatory, except when directly sending a proc literal to a lib `fun` in C bindings.
ja: 引数の型指定は必須です。ただし、C バインディングでライブラリの `fun` に直接 Proc リテラルを渡すときだけは例外です。

source: The underscore `_` before the suffix is optional.
ja: サフィックスの前のアンダースコア (`_`) はオプションです。

source: Their type is inferred from their usage, not only from their initializer.
ja: ローカル変数の型は、初期化されるときだけではなく、その用途にしたがって推論されます。

source: Their type is the combined type of all expressions that were assigned to them.
ja: 型は代入された式の型を組み合わせたものになります。

source: Then clone the repository:
ja: それから、リポジトリをクローンします。

source: Then you can invoke the compiler by just typing `crystal`.
ja: こうしておけば、`crystal` と入力するだけでコンパイラを起動することができます。

source: There are four signed integer types: [Int8](http://crystal-lang.org/api/Int8.html), [Int16](http://crystal-lang.org/api/Int16.html), [Int32](http://crystal-lang.org/api/Int32.html) and [Int64](http://crystal-lang.org/api/Int64.html), being able to represent numbers of 8, 16, 32 and 64 bits respectively.
ja: 符号付き整数 (Integer) 型には4種類のものがあります。それは、[Int8](http://crystal-lang.org/api/Int8.html)、[Int16](http://crystal-lang.org/api/Int16.html)、[Int32](http://crystal-lang.org/api/Int32.html) そして [Int64](http://crystal-lang.org/api/Int64.html)で、それぞれ 8/16/32/64 ビットの数値を表現することが可能です。

source: There are four unsigned integer types: [UInt8](http://crystal-lang.org/api/UInt8.html), [UInt16](http://crystal-lang.org/api/UInt16.html), [UInt32](http://crystal-lang.org/api/UInt32.html) and [UInt64](http://crystal-lang.org/api/UInt64.html).
ja: 符号なし整数型にも、[UInt8](http://crystal-lang.org/api/UInt8.html)、[UInt16](http://crystal-lang.org/api/UInt16.html)、[UInt32](http://crystal-lang.org/api/UInt32.html) そして [UInt64](http://crystal-lang.org/api/UInt64.html) の4種類が存在します。

source: There are two floating point types, [Float32](http://crystal-lang.org/api/Float32.html) and [Float64](http://crystal-lang.org/api/Float64.html), which correspond to the [binary32](http://en.wikipedia.org/wiki/Single_precision_floating-point_format) and [binary64](http://en.wikipedia.org/wiki/Double_precision_floating-point_format) types defined by IEEE.
ja: 浮動小数点数 (Float) には2つの種類があります。それは、[Float32](http://crystal-lang.org/api/Float32.html) と [Float64](http://crystal-lang.org/api/Float64.html) で、それぞれ IEEE によって定義されている [binary32](http://en.wikipedia.org/wiki/Single_precision_floating-point_format) と [binary64](http://en.wikipedia.org/wiki/Double_precision_floating-point_format) に対応しています。

source: They are constructed using these literals:
ja: 以下のようなリテラルで利用できます。

source: They are declared when you first assign them a value.
ja: その宣言は、はじめて値が代入されたときに行われます。

source: This ends up invoking `Object#to_s(IO)` on each expression enclosed by `#{...}`.
ja: このとき、`#{...}` で囲まれた式に対して、`Object#to_s(IO)` が実行されます。

source: This form allows you to specify the return type and to check it against the proc's body.
ja: この形式の場合、戻り値の型を指定することができるため、Proc の本体の戻り値が正しい型であるかをチェックすることが可能です。

source: This is the documentation for the Crystal programming language.
ja: 本ドキュメントは「Crystal」というプログラミング言語について記載するものです。

source: This script will execute the global installed compiler or the one that you just compiled (if present).
ja: このスクリプトは、グローバルにインストールされたコンパイラ、もしくは自分でビルドしたコンパイラがあればそれを実行します。

source: This will create a `some_program` file that you can execute:
ja: 上記では、`some_program` という実行ファイルが作成され、以下のようにして実行することができます。

source: To avoid this, you can split a string into multiple lines by joining multiple literals with a backslash:
ja: これを避けたければ、複数行の文字列リテラルをバックスラッシュで結合することができます。

source: To build your own version of the compiler, run `make`.
ja: コンパイラをビルドするときは、`make` を実行してください。

source: To compile and run a program in a single shot you can invoke `crystal` with a single filename:
ja: ファイル名を1つ指定して `crystal` コマンドを実行することで、プログラムのコンパイルと実行を一発で行うことができます。

source: To create a String with embedded expressions, you can use string interpolation:
ja: 文字列の中には式を埋め込むことが可能です。これを文字列埋め込み (文字列補完/String Interpolation ) といいます。

source: To create an empty tuple use [Tuple.new](http://crystal-lang.org/api/Tuple.html#new%28%2Aargs%29-class-method).
ja: 空のタプルを作りたい場合は、[Tuple.new](http://crystal-lang.org/api/Tuple.html#new%28%2Aargs%29-class-method) を使用してください。

source: To create an executable use the `build` command:
ja: 実行ファイルを作成するには `build` コマンドを使用します。

source: To easily install Crystall on Mac you can use our [Homebrew](http://brew.sh/) [tap](https://github.com/Homebrew/homebrew/wiki/brew-tap)
ja: Mac に Crystal をインストールする場合、[Homebrew](http://brew.sh/) の [tap](https://github.com/Homebrew/homebrew/wiki/brew-tap) を用意しているので、それを利用すると簡単です。

source: To invoke a Proc, you invoke the `call` method on it.
ja: Proc を実行するときは `call` メソッドを使います。

source: To make it simpler to use, you can create a symbolic link available in the path:
ja: 実行ファイルに対して、パスの通った場所のシンボリックを貼っておけば、より簡単に利用することができるでしょう。

source: To see the available options for a particuar command, use `--help` after a command:
ja: あるコマンドに対して有効なオプションを確認するには、コマンドに続けて `--help` を入力してください。

source: To see the full set of commands, invoke `crystal` without arguments.
ja: すべてのコマンドを確認するには、`crystal` コマンドを引数なしで実行してください。

source: To turn optimizations on, use the `--release` flag:
ja: 最適化を有効にしたければ、`--release` フラグを与える必要があります。

source: Underscores are allowed at the beginning of a variable name, but these names are reserved for the compiler, so their use is not recommended (and it also makes the code uglier to read).
ja: アンダースコアを変数名の先頭につけることも可能ですが、それらの名前はコンパイラによって予約されているため、先頭がアンダースコアの変数名は推奨されません (コードの見た目や読みやすさという点でもあまり美しくないですよね) 。

source: Underscores can be used to make some numbers more readable:
ja: アンダースコアは、数値を読みやすくするためにも利用できます。

source: Use the `init` command to create a Crystal project with the standard directory structure.
ja: `init` コマンドを使用すると、標準的なディレクトリ構成を持った Crystal プロジェクトを作成おすることができます。

source: When a new Crystal version is released you can upgrade your system using:
ja: 新しいバージョンの Crystal がリリースされた場合には、以下でアップグレードすることが可能です。

source: When creating an empty array you must always specify T:
ja: 空の配列を作りたいときには、必ず `T` を指定しなければなりません。

source: When creating an empty hash you must always specify `K` and `V`:
ja: 空のハッシュを作りたいときには、必ず `K` と `V` を指定しなければなりません。

source: You can declare/assign multiple variables at the same time by separating expressions with a comma (`,`):
ja: 複数の式をカンマ記号 (`,`) で区切って代入すると、複数の変数に対して同時に宣言/代入を行うことができます (多重代入) 。

source: You can read this document from top to bottom, but it’s advisable to jump through sections because some concepts are interrelated and can’t be explained in isolation.
ja: 本ドキュメントは基本的に最初から順番に読んでいけるように構成されています。ただ、コンセプトによっては、それぞれのコンセプトが相互に関連していて、どうしても単独では説明が難しいものがあります。そういった場合には、順番にこだわらず、別のセクションにジャンプしながら読み進めるのがよいでしょう。

source: You can use a backslash followed by an *u* and four hexadecimal characters to denote a unicode codepoint written:
ja: 「*u*」に続けてバックスラッシュと16進数で4つの数値を入力することでコードポイントを示すこともできます。

source: You can use a backslash followed by at most three digits to denote a code point written in octal:
ja: バックスラッシュに続けて最大3つの数値を入力すると、8進数でコードポイントを指定することになります。

source: You can use a backslash to denote some characters:
ja: いくつかの文字はバックスラッシュを使って表します。

source: You can use a special array literal syntax with other types too, as long as they define an argless `new` method and a `<<` method:
ja: 配列が持つ特別なシンタックスを他の型で使うこともできます。ただし、引数のない `new` と `<<` メソッドが定義されている必要があります。

source: You can use a special hash literal syntax with other types too, as long as they define an argless `new` method and a `[]=` method:
ja: ハッシュが持つ特別なシンタックスを他の型で使うこともできます。ただし、引数のない `new` と `[]=` メソッドが定義されている必要があります。

source: You might also want to read the [contributing guide](https://github.com/manastech/crystal/blob/master/Contributing.md).
ja: また、[コントリビューティング・ガイド](https://github.com/manastech/crystal/blob/master/Contributing.md) にも目を通しておくとよいでしょう。

source: You will also need LLVM 3.5 present in the path.
ja: また、あわせて LLVM 3.5 も必要です。

source: [Bool](http://crystal-lang.org/api/Bool.html) has only two possible values: `true` and `false`.
ja: 真偽値 ([Bool](http://crystal-lang.org/api/Bool.html)) には2つだけ値が存在します。それは `true` と `false` です。

source: ``` * You can define [local variables](../syntax_and_semantics/local_variables.html) without the need to specify their type:
ja: ``` * 型を指定することなく[ローカル変数](../syntax_and_semantics/local_variables.html)を定義することができます

source: ```ruby "\"" # double quote "\\" # backslash "\e" # escape "\f" # form feed "\n" # newline "\r" # carriage return "\t" # tab "\v" # vertical tab ```
ja: ```ruby "\"" # ダブルクォート "\\" # バックスラッシュ "\e" # エスケープ "\f" # フォームフィード (改ページ) "\n" # ニューライン (改行) "\r" # キャリッジリターン (復帰) "\t" # タブ "\v" # 垂直タブ ```

source: ```ruby "\101" # == "A" "\123" # == "S" "\12" # == "\n" "\1" # string with one character with code point 1 ```
ja: ```ruby "\101" # == "A" "\123" # == "S" "\12" # == "\n" "\1" # コードポイント1の文字が1つだけの文字列 ```

source: ```ruby "hello " \ "world, " \ "no newlines" # same as "hello world, no newlines" ```
ja: ```ruby "hello " \ "world, " \ "no newlines" # "hello world, no newlines" と同じ ```

source: ```ruby # A proc without arguments ->{ 1 } # Proc(Int32)
ja: ```ruby # 引数のない Proc ->{ 1 } # Proc(Int32)

source: ```ruby # A setter person.name=("John")
ja: ```ruby # セッター person.name=("John")

source: ```ruby # Assigns to a local variable local = 1
ja: ```ruby # ローカル変数への代入 local = 1

source: ```ruby # Supports double quotes and nested parenthesis %(hello ("world")) # same as "hello (\"world\")"
ja: ```ruby # ダブルクォートと入れ子のカッコを含む %(hello ("world")) # "hello (\"world\")" と同じ

source: ```ruby '\'' # single quote '\\' # backslash '\e' # escape '\f' # form feed '\n' # newline '\r' # carriage return '\t' # tab '\v' # vertical tab ```
ja: ```ruby '\'' # シングルクォート '\\' # バックスラッシュ '\e' # エスケープ '\f' # フォームフィード (改ページ) '\n' # ニューライン (改行) '\r' # キャリッジリターン (復帰) '\t' # タブ '\v' # 垂直タブ ```

# ```ruby '101' # == 'A' '123' # == 'S' '12' # == ' ' '1' # code point 1 ```
source: ```ruby '\101' # == 'A' '\123' # == 'S' '\12' # == '\n' '\1' # code point 1 ```
ja: ```ruby '\101' # == 'A' '\123' # == 'S' '\12' # == '\n' '\1' # コードポイント1 ```

source: ```ruby 1_000_000 # better than 1000000 ```
ja: ```ruby 1_000_000 # 1000000 より読みやすい ```

source: ```ruby 1_000_000.111_111 # better than 1000000.111111 ```
ja: ```ruby 1_000_000.111_111 # 1000000.111111 より読みやすい ```

source: ```ruby [] of Int32 # same as Array(Int32).new [] # syntax error ```
ja: ```ruby [] of Int32 # Array(Int32).new と同じ [] # シンタックスエラーになる ```

source: ```ruby local += 1 # same as: local = local + 1
ja: ```ruby local += 1 # local = local + 1 と同じ

source: ```ruby person.age += 1 # same as: person.age = person.age + 1
ja: ```ruby person.age += 1 # person.age = person.age + 1 と同じ

source: ```ruby x..y # an inclusive range, in mathematics: [x, y] x...y # an exclusive range, in mathematics: [x, y) ```
ja: ```ruby x..y # 右側の値を「含む」範囲です。数学的には閉区間となります: [x, y] x...y # 右側の値を「含まない」範囲です。数学的には左閉右開区間となります: [x, y) ```

source: ```ruby {} of Int32 => Int32 # same as Hash(Int32, Int32).new {} # syntax error ```
ja: ```ruby {} of Int32 => Int32 # Hash(Int32, Int32).new と同じ {} # シンタックスエラーになる ```

source: and you're ready to start hacking.
ja: これでハックする準備は OK です。

source: local ||= 1 # same as: local || (local = 1) local &&= 1 # same as: local && (local = 1) ```
ja: local ||= 1 # local || (local = 1) と同じ local &&= 1 # local && (local = 1) と同じ ```

source: no newlines" # same as "hello world, no newlines" ```
ja: no newlines" # "hello world, no newlines" と同じ ```

source: objects[1] += 2 # same as: objects[1] = objects[1] + 2
ja: objects[1] += 2 # objects[1] = objects[1] + 2 と同じ

source: objects[1] ||= 2 # same as: objects[1]? || (objects[1] = 2) objects[1] &&= 2 # same as: objects[1]? && (objects[1] = 2) ```
ja: objects[1] ||= 2 # objects[1]? || (objects[1] = 2) と同じ objects[1] &&= 2 # objects[1]? && (objects[1] = 2) と同じ ```

source: person.name ||= "John" # same as: person.name || (person.name = "John") person.name &&= "John" # same as: person.name && (person.name = "John")
ja: person.name ||= "John" # person.name || (person.name = "John") と同じ person.name &&= "John" # person.name && (person.name = "John") と同じ

# world" # same as "hello world" ```
source: world" # same as "hello\n world" ```
ja: world" # "hello\n world" と同じ ```
